In [1]:
import pandas as pd
import numpy as np
pd.__version__

'0.25.1'

In [2]:
twod_list = [[7, 'Cristiano Ronaldo', 'Portugal'], ['None', 'Park Ji Sung', 'South Korea'],
             [10, 'Lionel Messi', 'Argentina']]

ex_df = pd.DataFrame(twod_list, columns=['Number', 'Name', 'Country'])
ex_df

  Number               Name      Country
0      7  Cristiano Ronaldo     Portugal
1   None       Park Ji Sung  South Korea
2     10       Lionel Messi    Argentina

In [3]:
series = pd.Series([1,2,3,4,5,6,7])
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [4]:
n_array = np.array([1,2,3,4,5,6,7])
n_array

array([1, 2, 3, 4, 5, 6, 7])

In [16]:
temp_series = pd.Series([['a','b','c'], 1, 2])
temp_series

0    [a, b, c]
1            1
2            2
dtype: object

In [17]:
temp_series[1]

1

In [18]:
temp_series[0][2]

'c'

In [21]:
temp_series + temp_series

0    [a, b, c, a, b, c]
1                     2
2                     4
dtype: object

In [20]:
temp_series

0    [a, b, c]
1            1
2            2
dtype: object

In [24]:
temp_series.add(temp_series)

0    [a, b, c, a, b, c]
1                     2
2                     4
dtype: object

In [25]:
Df = pd.DataFrame(temp_series)
Df

           0
0  [a, b, c]
1          1
2          2

In [26]:
Df[0]

0    [a, b, c]
1            1
2            2
Name: 0, dtype: object

In [29]:
ex_df['Country']

0       Portugal
1    South Korea
2      Argentina
Name: Country, dtype: object

In [37]:
ex_df = pd.DataFrame(twod_list, columns=['Number', 'Name', 'Country'],
                     index=['Real Madrid', 'Manchester United', 'FC Barcelona'])

ex_df

                  Number               Name      Country
Real Madrid            7  Cristiano Ronaldo     Portugal
Manchester United   None       Park Ji Sung  South Korea
FC Barcelona          10       Lionel Messi    Argentina

In [38]:
ex_df.loc['Real Madrid']

Number                     7
Name       Cristiano Ronaldo
Country             Portugal
Name: Real Madrid, dtype: object

In [39]:
ex_df.loc[0]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [40]:
ex_df.iloc[1]

Number             None
Name       Park Ji Sung
Country     South Korea
Name: Manchester United, dtype: object

In [41]:
ex_df.iloc[-1]

Number               10
Name       Lionel Messi
Country       Argentina
Name: FC Barcelona, dtype: object

In [43]:
ex_df.iloc[0,1]

'Cristiano Ronaldo'

In [56]:
ex_df['Name']['Real Madrid']

'Cristiano Ronaldo'

In [59]:
df = pd.DataFrame(data=[['나영','결경','세정','청하','채연'],['미나','소혜','도연','유정','연정']], 
                  index=['언니라인','동생라인'], columns=list('아이오아이'))
df

       아   이   오   아   이
언니라인  나영  결경  세정  청하  채연
동생라인  미나  소혜  도연  유정  연정

In [61]:
type(df.index)

pandas.core.indexes.base.Index

In [62]:
type(df.columns)

pandas.core.indexes.base.Index

In [63]:
type(df.values)

numpy.ndarray

In [17]:
type(df.iloc)

pandas.core.indexing._iLocIndexer

In [18]:
type(df.loc)

pandas.core.indexing._LocIndexer

In [65]:
df = pd.DataFrame([['개','똥','아'],['똥','쌌','니'],['아','니','요']], columns=list('123'))
df_a = df
df_a

   1  2  3
0  개  똥  아
1  똥  쌌  니
2  아  니  요

In [66]:
df_a['1'] = 100
df_a

     1  2  3
0  100  똥  아
1  100  쌌  니
2  100  니  요

In [67]:
df

     1  2  3
0  100  똥  아
1  100  쌌  니
2  100  니  요

In [22]:
id(df),id(df_a)

(4662992656, 4662992656)

In [23]:
df.values.base is df_a.values.base

True

In [70]:
df_b = df + df
df_b

     1   2   3
0  200  똥똥  아아
1  200  쌌쌌  니니
2  200  니니  요요

In [71]:
id(df_b),id(df)

(4750503504, 4911710416)

In [72]:
df_b.values.base is df.values.base

False

In [73]:
df

     1  2  3
0  100  똥  아
1  100  쌌  니
2  100  니  요

In [92]:
se_1 = pd.Series(index=list('random'),data=np.arange(6))
se_2 = se_1
se_2[0] = 100
se_2

r    100
a      1
n      2
d      3
o      4
m      5
dtype: int64

In [93]:
se_1

r    100
a      1
n      2
d      3
o      4
m      5
dtype: int64

In [94]:
se_2 is se_1

True

In [96]:
se_3 = se_1.copy()
se_3[0] = 0
se_3

r    0
a    1
n    2
d    3
o    4
m    5
dtype: int64

In [97]:
se_1

r    100
a      1
n      2
d      3
o      4
m      5
dtype: int64

In [98]:
se_3 is se_1

False

In [32]:
pd.Series.__getitem__

In [33]:
pd.DataFrame.__getitem__

In [34]:
pd.Index.__getitem__

In [35]:
pd.MultiIndex.__getitem__

In [99]:
df = pd.DataFrame([[4, 'Sergio Ramos', 'Spain'],
                   [7, 'Cristiano Ronaldo', 'Portugal'],[10, 'Leonel Messi', 'Argentina']], 
                  index=['Real Madrid', 'Juventus','FC Barcelona'], columns=['Number','Name','Country'])
df

              Number               Name    Country
Real Madrid        4       Sergio Ramos      Spain
Juventus           7  Cristiano Ronaldo   Portugal
FC Barcelona      10       Leonel Messi  Argentina

In [100]:
df.loc.__getitem__

In [101]:
df.iloc.__getitem__

In [103]:
df['Name']

Real Madrid          Sergio Ramos
Juventus        Cristiano Ronaldo
FC Barcelona         Leonel Messi
Name: Name, dtype: object

In [104]:
df.__getitem__('Name')

Real Madrid          Sergio Ramos
Juventus        Cristiano Ronaldo
FC Barcelona         Leonel Messi
Name: Name, dtype: object

In [105]:
series = df['Name']
series

Real Madrid          Sergio Ramos
Juventus        Cristiano Ronaldo
FC Barcelona         Leonel Messi
Name: Name, dtype: object

In [106]:
series['Juventus']

'Cristiano Ronaldo'

In [107]:
series.__getitem__('Juventus')

'Cristiano Ronaldo'

In [112]:
series.__getitem__(series == 'Cristiano Ronaldo')

Juventus    Cristiano Ronaldo
Name: Name, dtype: object

In [114]:
df.__getitem__(df == 'Spain')

/Users/kimjuhun/opt/anaconda3/lib/python3.7/site-packages/pandas/core/ops/__init__.py:1115: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

              Number Name Country
Real Madrid      NaN  NaN   Spain
Juventus         NaN  NaN     NaN
FC Barcelona     NaN  NaN     NaN

In [115]:
bc = pd.DataFrame({'a' : np.random.randn(4), 'b' : np.random.randn(4), 'c' : np.random.randn(4)})
bc

          a         b         c
0 -1.396486 -0.030346  0.063633
1  0.004973  0.646884 -0.174310
2 -0.364668 -3.373489 -2.474481
3  0.094095  0.044573  0.066140

In [116]:
bc = bc * [10, 20, 30]
bc

           a          b          c
0 -13.964858  -0.606929   1.908987
1   0.049734  12.937690  -5.229288
2  -3.646677 -67.469778 -74.234416
3   0.940954   0.891465   1.984215

In [2]:
list1 = np.array([1,2,3,4,5])
list2 = np.array([1,3,5])
list1 + list2

ValueError: operands could not be broadcast together with shapes (5,) (3,)

In [10]:
Df = pd.DataFrame([[1,3,5],[2,4,6],[3,6,9]], index=list('ABC'))
Df

   0  1  2
A  1  3  5
B  2  4  6
C  3  6  9

In [14]:
Df_2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=list('ABC'))
Df_2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
Df+3

   0  1   2
A  4  6   8
B  5  7   9
C  6  9  12

In [16]:
Df + Df_2

    0   1   2   A   B   C
A NaN NaN NaN NaN NaN NaN
B NaN NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN NaN
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN

In [18]:
Df = pd.DataFrame([[1,3,5],[2,4,6],[3,6,9]], columns=list('ABC'))
Df

   A  B  C
0  1  3  5
1  2  4  6
2  3  6  9

In [19]:
Df + Df_2

    A   B   C
0   2   5   8
1   6   9  12
2  10  14  18

In [20]:
type(Df.__add__)

method

In [21]:
type(Df.__add__.__func__)

function

In [22]:
type(Df.add)

method

In [23]:
type(Df.add.__func__)

function

In [24]:
Df.__add__.__func__ is Df.add.__func__

False

In [25]:
df_na = pd.DataFrame([2, 4, np.nan])
df_na

     0
0  2.0
1  4.0
2  NaN

In [26]:
df_na[0]

0    2.0
1    4.0
2    NaN
Name: 0, dtype: float64

In [27]:
df_na.sum()

0    6.0
dtype: float64

In [28]:
df_na.sum(skipna=False)

0   NaN
dtype: float64

In [29]:
df_na < 3

       0
0   True
1  False
2  False

In [30]:
df_na < np.nan

       0
0  False
1  False
2  False

In [8]:
df_four = pd.Series([1,2,3,4])
df_four

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
df_four.sum(axis=0)

10

In [31]:
df_sample = pd.DataFrame([[0,2,4,8,10],[1,3,5,7,9]], index=list('12'), columns=list('ABCDE'))
df_sample

   A  B  C  D   E
1  0  2  4  8  10
2  1  3  5  7   9

In [32]:
df_sample.sum(axis=0)

A     1
B     5
C     9
D    15
E    19
dtype: int64

In [33]:
df_sample.sum(axis=1)

1    24
2    25
dtype: int64

In [35]:
df_sample = pd.DataFrame(np.random.randint(1,20,(5, 5)), columns=list('ABCDE'))
df_sample

    A   B   C   D   E
0  16  12   5  15   8
1  11  12   9  17  15
2   3  11   9  17  19
3  12   8   5  15  16
4   3  14  13  12   7

In [36]:
df_sample2 = pd.DataFrame(np.random.randint(1, 40, (5, 5)), columns=list('DABEC'))
df_sample2

    D   A   B   E   C
0  25  26  15  11  37
1   9   9  36   5   4
2   2  30  38  27  16
3  34  18  29  11   2
4  17  20  10  28  16

In [44]:
np.log(df_sample2)

          D         A         B         E         C
0  3.218876  3.258097  2.708050  2.397895  3.610918
1  2.197225  2.197225  3.583519  1.609438  1.386294
2  0.693147  3.401197  3.637586  3.295837  2.772589
3  3.526361  2.890372  3.367296  2.397895  0.693147
4  2.833213  2.995732  2.302585  3.332205  2.772589

In [41]:
df_sample + df_sample2

    A   B   C   D   E
0  42  27  42  40  19
1  20  48  13  26  20
2  33  49  25  19  46
3  30  37   7  49  27
4  23  24  29  29  35

In [46]:
df_sample3 = pd.DataFrame(np.random.randint(1, 20, (3,3)), columns=list('BCD'))
df_sample3

    B   C   D
0   1  16  15
1  13   4  15
2  19   6  11

In [47]:
df_sample + df_sample3

    A     B     C     D   E
0 NaN  13.0  21.0  30.0 NaN
1 NaN  25.0  13.0  32.0 NaN
2 NaN  30.0  15.0  28.0 NaN
3 NaN   NaN   NaN   NaN NaN
4 NaN   NaN   NaN   NaN NaN

In [19]:
import chardet
def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [20]:
my_encoding = find_encoding('../Pandas/example.csv')
df_1 = pd.read_csv('../Pandas/example.csv', encoding=my_encoding)
my_encoding

'UTF-8-SIG'

In [21]:
df_1.head()

   학년       학과   이름   성적
0   4   컴퓨터공학과  김소혜  4.5
1   3  정보통신공학과  김도연  4.4
2   4  정보통신공학과  최유정  4.3
3   4   영어영문학과  강미나  4.2
4   3     경영학과  유연정  4.3

In [22]:
df_1.head(2)

   학년       학과   이름   성적
0   4   컴퓨터공학과  김소혜  4.5
1   3  정보통신공학과  김도연  4.4

In [25]:
df_3 = pd.read_csv('../Pandas/example.csv', engine='python')
df_3.head(3)

                학년
4 컴퓨터공학과  김소혜  4.5
3 정보통신공학과 김도연  4.4
4 정보통신공학과 최유정  4.3

In [27]:
df_1.head()

   학년       학과   이름   성적
0   4   컴퓨터공학과  김소혜  4.5
1   3  정보통신공학과  김도연  4.4
2   4  정보통신공학과  최유정  4.3
3   4   영어영문학과  강미나  4.2
4   3     경영학과  유연정  4.3

In [28]:
df_1.drop('성적', axis=1).head()

   학년       학과   이름
0   4   컴퓨터공학과  김소혜
1   3  정보통신공학과  김도연
2   4  정보통신공학과  최유정
3   4   영어영문학과  강미나
4   3     경영학과  유연정